Tekla Open API Reference for Tekla Structures 2025
PickerInputObject.PickedObject Property
 Gets or sets the picked object in the view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObject PickedObject { get; set; }
Public Property PickedObject As DrawingObject
	Get
	Set
Property Value
Type: DrawingObject
See Also
Reference
PickerInputObject Class
Tekla.Structures.Drawing Namespace